cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"

brew 'anyenv'
brew 'bat' #cat
brew 'bottom' #top
brew 'exa' #ls
brew 'dust' #du
brew 'duf' #df
brew 'fd' #find
brew 'git'
brew 'httpie' #curl
brew 'jq'
brew 'mas'
brew 'procs' #ps
brew 'ripgrep' #grep
brew 'rsync'
brew 'starship'
brew 'terraform'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'zoxide' #cd

cask '1password'
cask 'alfred'
cask 'adobe-creative-cloud'
cask 'appcleaner'
cask 'bartender'
cask 'clipy'
cask 'cyberduck'
cask 'deepl'
# cask 'dropbox'
cask 'docker'
cask 'google-chrome'
cask 'kindle'
cask 'kobo'
cask 'microsoft-remote-desktop'
cask 'postman'
cask 'rectangle'
cask 'sequel-ace'
cask 'sourcetree'
cask 'spotify'
cask 'swiftbar'
cask 'visual-studio-code'

cask 'font-hack-nerd-font'

mas 'RunCat', id: 1429033973
mas 'WireGuard', id: 1451685025
# mas 'LINE', id: 539883307
# mas 'GoodNotes', id: 1444383602
# mas 'Final Cut Pro', id: 424389933